Tekla Open API Reference for Tekla Structures 2025
ReinforcementPulloutElement Properties
The ReinforcementPulloutElement type exposes the following members.
Properties
Name | Description
AutomaticScaling
 Gets or sets a value indicating whether the pull-out is scaled automatically or to a specified value.
BendingAngle
 Gets or sets a value indicating whether to show the pull-out bending angles.
BendingRadius
 Gets or sets a value indicating whether to show the pull-out bending radii.
CouplersEndAnchorSymbols
 Gets or sets a value indicating whether to show coupler/anchor symbols or not.
CouplersScale
 Gets or sets the scale of coupler/anchor symbols.
Dimensioning
 Gets or sets a value indicating whether to show the pull-out dimensions.
EndSymbolType
 Gets or sets the type of the ending marks.
Exaggeration
 Gets or sets a value indicating whether the pull-out is exaggerated.
Font
 Gets or sets the font of the dimension.
RotationAxis
 Gets or sets the rotation of the pull-out.
ScaleX
 Gets or sets the scaling of the pull-out in the X direction.
ScaleY
 Gets or sets the scaling of the pull-out in the Y direction.
Top
See Also
Reference
ReinforcementPulloutElement Class
Tekla.Structures.Drawing Namespace